IDEA Open Model
LineSupport.GeneralLine Property
Compatible with IDEA StatiCa v 10.1
 general shape
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public PolyLine2D GeneralLine { get; set; }
Public Property GeneralLine As PolyLine2D
	Get
	Set
public:
property PolyLine2D^ GeneralLine {
	PolyLine2D^ get ();
	void set (PolyLine2D^ value);
}
Property Value
Type: PolyLine2D
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace